InformationRegisters/ПрименениеВычетовПоВидамДохода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПрименениеВычетовПоВидамДохода</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидВычетаИПН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВычетовИПН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыПредоставленияВычетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПредоставленияВычетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоИсчисленнойСуммеВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стандартный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПериодическимПлатежам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ПрименениеВычетовПоВидамДохода/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		
		// с 2026 года необходимо заполнять виды доходов для элементов справочника Виды вычетов ИПН
		Если СтрокаНабора.Период >= Дата('20260101') Тогда
			Возврат;	
		КонецЕсли;
		
		Если СтрокаНабора.Период < Дата('20190101') Тогда
			
			ВызватьИсключение НСтр("ru = 'Применение вычетов по разным видам дохода поддерживается с 2019 года'");	
			
		КонецЕсли;
		
		Если СтрокаНабора.Период < Дата('20250101')
			И СтрокаНабора.ВидВычетаИПН = Справочники.ВидыВычетовИПН.Стандартный1МЗП Тогда
			
			ВызватьИсключение НСтр("ru = 'Применение стандартного вычета (14 МРП) по разным видам дохода поддерживается с 2025 года'");	
			
		КонецЕсли;
		
		РеквизитыВычета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаНабора.ВидВычетаИПН, "ПредоставлениеВычета, Предопределенный"); 
		
		МассивВычетовСРазнымиВидамДоходов = Новый Массив;
		МассивВычетовСРазнымиВидамДоходов.Добавить(Справочники.ВидыВычетовИПН.Стандартный1МЗП);
		МассивВычетовСРазнымиВидамДоходов.Добавить(Справочники.ВидыВычетовИПН.Стандартный75МЗПИнвалиды);
		МассивВычетовСРазнымиВидамДоходов.Добавить(Справочники.ВидыВычетовИПН.Стандартный75МЗПРодители);
		МассивВычетовСРазнымиВидамДоходов.Добавить(Справочники.ВидыВычетовИПН.БазовыйНалоговыйВычет);
		МассивВычетовСРазнымиВидамДоходов.Добавить(Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет1_2Группа);
		МассивВычетовСРазнымиВидамДоходов.Добавить(Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет3Группа);
		МассивВычетовСРазнымиВидамДоходов.Добавить(Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычетРодители);
		
		СтрокаВидыВычетов = "";
		ЭтоПерваяСтрока = Истина;
		
		Для Каждого ВидВычета Из МассивВычетовСРазнымиВидамДоходов Цикл
			
			Если ЭтоПерваяСтрока Тогда
				
				СтрокаВидыВычетов = СтрокаВидыВычетов + ВидВычета;
				ЭтоПерваяСтрока = Ложь;
				
				Продолжить;
				
			КонецЕсли;	
			
			СтрокаВидыВычетов = СтрокаВидыВычетов + ", " + ВидВычета;
			
		КонецЦикла;
		
		
		Если РеквизитыВычета.Предопределенный И МассивВычетовСРазнымиВидамДоходов.Найти(СтрокаНабора.ВидВычетаИПН) = Неопределено Тогда
			
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Применение суммы вычета по разным видам дохода допускается использовать для видов вычета: %1'"), СтрокаВидыВычетов)
			
		КонецЕсли;
		
		Если РеквизитыВычета.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов Тогда
			
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Применение суммы вычета по разным видам дохода не допускается до 1 января 2026 года для вычета с предоставлением ""По исчисленной сумме взносов"": %1'"), СтрокаНабора.ВидВычетаИПН);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
